
** 15° Yaw Angle transient


*** 1. Backup test


#+RESULTS: TEST Backup


#+BEGIN_SRC bash :dir "M:\\fluentYaw15\\transient\\"
  pwd
  ls sphere*.cas|awk -F"-" 'BEGIN{i=1}{print substr($5,0,length($5)-4),",",i; i=i+1}'
#+END_SRC

#+RESULTS:
|      2752 | 1 |
| 10.013916 | 2 |


***  1.1 Backup

#+NAME: Backup
#+BEGIN_SRC bash :result value :dir M:\\FLUENTYAW15\\transient\\
      pwd
  #  ls *.cas|awk -F"-" '{print $5}'
#  ls sphere*.cas|awk -F"-" 'BEGIN{i=1}{print substr($5,0,length($5)-8),",",i; i=i+1}'
# 
ls sphere*.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-15-1.csv";}{print substr($5,0,length($5)-4),",",i >prefix; i=i+1}' 

#+END_SRC

#+RESULTS: Backup

*** 2. Rename test

rename第二列是要替换的表达式  第三列是要替换的形式(缩列形式)  第四列是文件名


#+BEGIN_SRC bash :dir M:\\fluentYaw15\\transient\\
   ls *.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-15-1-";postfix=".cas"}
     {originalFile=prefix""substr($5,0,length($5)-4);cmd="rename "originalFile" "sprintf("%03d",i)" "originalFile""postfix;i=i+1;print cmd;}'

#+END_SRC

#+RESULTS:
| rename | sphere12-14-15-1-02752     | 1 | sphere12-14-15-1-02752.cas     |
| rename | sphere12-14-15-1-10.013916 | 2 | sphere12-14-15-1-10.013916.cas |




*** 2.1 Rename 

#+NAME: TEST rename file to 1,2,3
#+BEGIN_SRC bash :dir M:\\FLUENTYAW15\\transient\\
   ls *.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-15-1-";postfix=".cas"}
     {originalFile=prefix""substr($5,0,length($5)-4);cmd="rename "originalFile" "sprintf("%03d",i)" "originalFile""postfix;i=i+1;system(cmd);}'

#+END_SRC


***  3. Recovery Tests

#+BEGIN_SRC bash :dir "M:\\fluentYaw15\\transient\\"
  cat sphere*.csv|awk -F, 'BEGIN{prefix="sphere12-14-15-1-";postfix=".cas"}
{output=prefix""substr($1,0,length($1)-1)""postfix;input=sprintf("%03d",$2)""postfix;cmd="rename "input" "output" "input;print cmd;}'

#+END_SRC

#+RESULTS:
| rename | 001.cas | sphere12-14-15-1-02752.cas     | 001.cas |
| rename | 002.cas | sphere12-14-15-1-10.013916.cas | 002.cas |

*** 3.1 Recovery


#+BEGIN_SRC bash :dir "M:\\fluentYaw15\\transient\\"
  cat sphere*.csv|awk -F, 'BEGIN{prefix="sphere12-14-15-1-";postfix=".cas"}
{output=prefix""substr($1,0,length($1)-1)""postfix;input=sprintf("%03d",$2)""postfix;cmd="rename "input" "output" "input;system(cmd);}'

#+END_SRC

#+RESULTS:

** 15° Yaw Angle 


*** 1. Backup test


#+RESULTS: TEST Backup


#+BEGIN_SRC bash :dir "M:\\fluentYaw15\\"
  pwd
  ls sphere*.cas|awk -F"-" 'BEGIN{i=1}{print substr($5,0,length($5)-4),",",i; i=i+1}'
#+END_SRC

#+RESULTS:
| 11.682901 |   1 |
| 11.700288 |   2 |
| 11.711878 |   3 |
| 11.723468 |   4 |
| 11.735058 |   5 |
| 11.746648 |   6 |
| 11.758239 |   7 |
| 11.769829 |   8 |
| 11.781419 |   9 |
| 11.793009 |  10 |
| 11.804599 |  11 |
| 11.816189 |  12 |
|  11.82778 |  13 |
|  11.83937 |  14 |
|  11.85096 |  15 |
|  11.86255 |  16 |
|  11.87414 |  17 |
| 11.885731 |  18 |
| 11.897321 |  19 |
| 11.908911 |  20 |
| 11.920501 |  21 |
| 11.932091 |  22 |
| 11.943681 |  23 |
| 11.955272 |  24 |
| 11.966862 |  25 |
| 11.978452 |  26 |
| 11.990042 |  27 |
| 12.001632 |  28 |
| 12.013223 |  29 |
| 12.024813 |  30 |
| 12.036403 |  31 |
| 12.047993 |  32 |
| 12.059583 |  33 |
| 12.071174 |  34 |
| 12.082764 |  35 |
| 12.094354 |  36 |
| 12.105944 |  37 |
| 12.117534 |  38 |
| 12.129124 |  39 |
| 12.140715 |  40 |
| 12.152305 |  41 |
| 12.163895 |  42 |
| 12.175485 |  43 |
| 12.187075 |  44 |
| 12.198666 |  45 |
| 12.210256 |  46 |
| 12.221846 |  47 |
| 12.233436 |  48 |
| 12.245026 |  49 |
| 12.256617 |  50 |
| 12.268207 |  51 |
| 12.279797 |  52 |
| 12.291387 |  53 |
| 12.302977 |  54 |
| 12.314567 |  55 |
| 12.326158 |  56 |
| 12.337748 |  57 |
| 12.349338 |  58 |
| 12.360928 |  59 |
| 12.372518 |  60 |
| 12.384109 |  61 |
| 12.395699 |  62 |
| 12.407289 |  63 |
| 12.418879 |  64 |
| 12.430469 |  65 |
| 12.442059 |  66 |
|  12.45365 |  67 |
|  12.46524 |  68 |
|  12.47683 |  69 |
|  12.48842 |  70 |
|  12.50001 |  71 |
|   12.5116 |  72 |
|  12.52319 |  73 |
| 12.534781 |  74 |
| 12.546371 |  75 |
| 12.557961 |  76 |
| 12.569551 |  77 |
| 12.581141 |  78 |
| 12.592731 |  79 |
| 12.604321 |  80 |
| 12.615911 |  81 |
| 12.627501 |  82 |
| 12.639092 |  83 |
| 12.650682 |  84 |
| 12.662272 |  85 |
| 12.673862 |  86 |
| 12.685452 |  87 |
| 12.697042 |  88 |
| 12.708633 |  89 |
| 12.720223 |  90 |
| 12.731813 |  91 |
| 12.743403 |  92 |
| 12.754993 |  93 |
| 12.766584 |  94 |
| 12.778174 |  95 |
| 12.789764 |  96 |
| 12.801354 |  97 |
| 12.812944 |  98 |
| 12.824535 |  99 |
| 12.836125 | 100 |
| 12.847715 | 101 |
| 12.859305 | 102 |
| 12.870895 | 103 |
| 12.882486 | 104 |
| 12.894076 | 105 |
| 12.905666 | 106 |
| 12.917256 | 107 |
| 12.928846 | 108 |
| 12.940437 | 109 |
| 12.952027 | 110 |
| 12.963617 | 111 |
| 12.975207 | 112 |
| 12.986797 | 113 |
| 12.998387 | 114 |
| 13.009977 | 115 |
| 13.021568 | 116 |
| 13.033158 | 117 |
| 13.044748 | 118 |
| 13.056338 | 119 |
| 13.067928 | 120 |
| 13.079519 | 121 |
| 13.091109 | 122 |
| 13.102699 | 123 |
| 13.114289 | 124 |
| 13.125879 | 125 |
|  13.13747 | 126 |
|  13.14906 | 127 |
|  13.16065 | 128 |
|  13.17224 | 129 |
|  13.18383 | 130 |
| 13.195421 | 131 |
| 13.207011 | 132 |
| 13.218601 | 133 |
| 13.230191 | 134 |
| 13.241781 | 135 |
| 13.253372 | 136 |
| 13.264962 | 137 |
| 13.276552 | 138 |
| 13.288142 | 139 |
| 13.299732 | 140 |
| 13.311322 | 141 |
| 13.322913 | 142 |
| 13.334503 | 143 |
| 13.346093 | 144 |
| 13.357683 | 145 |
| 13.369273 | 146 |
| 13.380863 | 147 |
| 13.392454 | 148 |
| 13.404044 | 149 |
| 13.415634 | 150 |
| 13.427224 | 151 |
| 13.438815 | 152 |
| 13.450405 | 153 |
| 13.461995 | 154 |
| 13.473585 | 155 |
| 13.485175 | 156 |
| 13.496766 | 157 |
| 13.508356 | 158 |
| 13.519946 | 159 |
| 13.531536 | 160 |
| 13.543126 | 161 |
| 13.554716 | 162 |
| 13.566307 | 163 |
| 13.577897 | 164 |
| 13.589487 | 165 |
| 13.601077 | 166 |
| 13.612667 | 167 |
| 13.624258 | 168 |
| 13.635848 | 169 |
| 13.647438 | 170 |
| 13.659028 | 171 |
| 13.670618 | 172 |
| 13.682208 | 173 |
| 13.693799 | 174 |
| 13.705389 | 175 |
| 13.716979 | 176 |
| 13.728569 | 177 |
| 13.740159 | 178 |
|  13.75175 | 179 |
|  13.76334 | 180 |
|  13.77493 | 181 |
|  13.78652 | 182 |
|  13.79811 | 183 |
| 13.809701 | 184 |
| 13.821291 | 185 |
| 13.832881 | 186 |
| 13.844471 | 187 |
| 13.856061 | 188 |
| 13.867651 | 189 |
| 13.879242 | 190 |
| 13.890832 | 191 |
| 13.902422 | 192 |
| 13.914012 | 193 |
| 13.925602 | 194 |
| 13.937193 | 195 |
| 13.948783 | 196 |
| 13.960373 | 197 |
| 13.971963 | 198 |
| 13.983553 | 199 |
| 13.995144 | 200 |
| 14.006734 | 201 |
| 14.018324 | 202 |
| 14.029914 | 203 |
| 14.041504 | 204 |
| 14.053094 | 205 |
| 14.064685 | 206 |
| 14.076275 | 207 |
| 14.087865 | 208 |
| 14.099455 | 209 |
| 14.111045 | 210 |
| 14.122636 | 211 |
| 14.134226 | 212 |
| 14.145816 | 213 |
| 14.168996 | 214 |
| 14.180586 | 215 |
| 14.192177 | 216 |


***  1.1 Backup

#+NAME: Backup
#+BEGIN_SRC bash :result value :dir M:\\FLUENTYAW15\\
      pwd
  #  ls *.cas|awk -F"-" '{print $5}'
#  ls sphere*.cas|awk -F"-" 'BEGIN{i=1}{print substr($5,0,length($5)-8),",",i; i=i+1}'
# 
ls sphere*.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-15-1.csv";}{print substr($5,0,length($5)-4),",",i >prefix; i=i+1}' 

#+END_SRC

#+RESULTS: Backup

*** 2. Rename test

#+NAME: TEST  rename cas file to 1,2,3
#+BEGIN_SRC bash :dir "M:\\fluentYaw15"
   ls *.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-15-1-";postfix=".cas"}
     {originalFile=prefix""substr($5,0,length($5)-4);cmd="rename "originalFile" "sprintf("%03d",i)" "originalFile""postfix;i=i+1;print(cmd);}'

#+END_SRC


#+NAME: TEST  rename dat file to 1,2,3
#+BEGIN_SRC bash :dir "M:\\fluentYaw15"
   ls *.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-15-1-";postfix=".dat"}
     {originalFile=prefix""substr($5,0,length($5)-4);cmd="rename "originalFile" "sprintf("%03d",i)" "originalFile""postfix;i=i+1;print(cmd);}'

#+END_SRC

#+RESULTS: TEST  rename dat file to 1,2,3
| rename | sphere12-14-15-1- |   1 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |   2 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |   3 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |   4 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |   5 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |   6 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |   7 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |   8 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |   9 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  10 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  11 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  12 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  13 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  14 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  15 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  16 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  17 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  18 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  19 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  20 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  21 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  22 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  23 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  24 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  25 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  26 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  27 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  28 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  29 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  30 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  31 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  32 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  33 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  34 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  35 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  36 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  37 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  38 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  39 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  40 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  41 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  42 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  43 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  44 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  45 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  46 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  47 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  48 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  49 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  50 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  51 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  52 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  53 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  54 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  55 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  56 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  57 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  58 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  59 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  60 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  61 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  62 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  63 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  64 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  65 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  66 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  67 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  68 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  69 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  70 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  71 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  72 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  73 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  74 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  75 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  76 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  77 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  78 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  79 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  80 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  81 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  82 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  83 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  84 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  85 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  86 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  87 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  88 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  89 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  90 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  91 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  92 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  93 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  94 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  95 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  96 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  97 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  98 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- |  99 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 100 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 101 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 102 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 103 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 104 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 105 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 106 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 107 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 108 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 109 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 110 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 111 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 112 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 113 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 114 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 115 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 116 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 117 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 118 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 119 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 120 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 121 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 122 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 123 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 124 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 125 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 126 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 127 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 128 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 129 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 130 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 131 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 132 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 133 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 134 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 135 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 136 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 137 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 138 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 139 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 140 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 141 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 142 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 143 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 144 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 145 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 146 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 147 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 148 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 149 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 150 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 151 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 152 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 153 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 154 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 155 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 156 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 157 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 158 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 159 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 160 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 161 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 162 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 163 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 164 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 165 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 166 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 167 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 168 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 169 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 170 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 171 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 172 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 173 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 174 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 175 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 176 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 177 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 178 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 179 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 180 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 181 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 182 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 183 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 184 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 185 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 186 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 187 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 188 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 189 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 190 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 191 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 192 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 193 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 194 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 195 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 196 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 197 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 198 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 199 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 200 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 201 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 202 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 203 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 204 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 205 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 206 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 207 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 208 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 209 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 210 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 211 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 212 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 213 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 214 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 215 | sphere12-14-15-1-.dat |
| rename | sphere12-14-15-1- | 216 | sphere12-14-15-1-.dat |


rename第二列是要替换的表达式  第三列是要替换的形式(缩列形式)  第四列是文件名

#+RESULTS: TEST rename file to 1,2,3

*** 2.1 Rename 

#+NAME:  rename cas file to 1,2,3
#+BEGIN_SRC bash :dir "M:\\fluentYaw15"
   ls *.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-15-1-";postfix=".cas"}
     {originalFile=prefix""substr($5,0,length($5)-4);cmd="rename "originalFile" "sprintf("%03d",i)" "originalFile""postfix;i=i+1;system(cmd);}'

#+END_SRC

#+NAME:  rename dat file to 1,2,3
#+BEGIN_SRC bash :dir "M:\\fluentYaw15"
   ls *.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-15-1-";postfix=".dat"}
     {originalFile=prefix""substr($5,0,length($5)-4);cmd="rename "originalFile" "sprintf("%03d",i)" "originalFile""postfix;i=i+1;system(cmd);}'

#+END_SRC


***  3. Recovery Tests

#+BEGIN_SRC bash :dir "M:\\fluentYaw15\\transient\\"
  cat sphere*.csv|awk -F, 'BEGIN{prefix="sphere12-14-15-1-";postfix=".cas"}
{output=prefix""substr($1,0,length($1)-1)""postfix;input=sprintf("%03d",$2)""postfix;cmd="rename "input" "output" "input;print cmd;}'

#+END_SRC

#+RESULTS:
| rename | 001.cas | sphere12-14-15-1-02752.cas     | 001.cas |
| rename | 002.cas | sphere12-14-15-1-10.013916.cas | 002.cas |

*** 3.1 Recovery


#+BEGIN_SRC bash :dir "M:\\fluentYaw15\\transient\\"
  cat sphere*.csv|awk -F, 'BEGIN{prefix="sphere12-14-15-1-";postfix=".cas"}
{output=prefix""substr($1,0,length($1)-1)""postfix;input=sprintf("%03d",$2)""postfix;cmd="rename "input" "output" "input;system(cmd);}'

#+END_SRC

#+RESULTS:

